$(document).ready(function () {
    $('#form_clienteCPF').mask('000.000.000-00', {reverse: true});
    $('#form_clienteNome').mask('********************************************************************',{
        translation:{
            '*': {
                pattern : (/[A-Za-záàâãéèêíïóôõöúçñÁÀÂÃÉÈÍÏÓÔÕÖÚÇÑ\s ]/)
            }
        }
    });

    $('#nameNumeroProcesso').mask('00000000000000000000000000000000000000000000000000000000',{

    });

    $('#group_natureza').mask('********************************************************************',{
        translation:{
            '*': {
                pattern : (/[A-Za-záàâãéèêíïóôõöúçñÁÀÂÃÉÈÍÏÓÔÕÖÚÇÑ\s ]/)
            }
        }
    });

})
